# Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#### 0. Создать датафрейм.

In [3]:
df = pd.DataFrame(data, labels)

#### 1. Вывести информацию о датафрейме.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
animal      10 non-null object
age         8 non-null float64
visits      10 non-null int64
priority    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [12]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [6]:
df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

#### 3. Выберите только столбцы 'animal' и 'age' из DataFrame `df`.

In [7]:
df.loc[:, ['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['animal', 'age']`.

In [10]:
df.iloc[[3,4,8],[0,1]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

#### 5. Выберите строки где количество посещений больше 3.

In [11]:
df[df.visits>3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

#### 6. Выберите строки, в которых отсутствует возраст.

In [14]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

#### 7. Выберите строки, в которых животное является кошкой * и * возраст составляет менее 3 лет.

In [15]:
df[(df.animal=='cat') & (df.age < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

#### 8. Выберите строки в которых возраст от 2 до 4 (включительно).

In [16]:
df[(df.age>=2) & (df.age<=4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

#### 9. Измените возраст в строке 'f' на 1,5.

In [19]:
df.loc['f','age'] = 1.5
df.loc['f']

animal      cat
age         1.5
visits        3
priority     no
Name: f, dtype: object

#### 10. Рассчитать общее количество всех посещений.

In [20]:
sum(df.visits)

19

#### 11. Расчитайте суммарный возраст животных

In [22]:
df.sum()['age']

27.0

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [24]:
df.loc['k'] = ['pig', 10.0, 123456.0, 'no']
print(df)
df.drop('k', inplace=True)
df

  animal   age    visits priority
a    cat   2.5       1.0      yes
b    cat   3.0       3.0      yes
c  snake   0.5       2.0       no
d    dog   NaN       3.0      yes
e    dog   5.0       2.0       no
f    cat   1.5       3.0       no
g  snake   4.5       1.0       no
h    cat   NaN       1.0      yes
i    dog   7.0       2.0       no
j    dog   3.0       1.0       no
k    pig  10.0  123456.0       no

  animal  age  visits priority
a    cat  2.5     1.0      yes
b    cat  3.0     3.0      yes
c  snake  0.5     2.0       no
d    dog  NaN     3.0      yes
e    dog  5.0     2.0       no
f    cat  1.5     3.0       no
g  snake  4.5     1.0       no
h    cat  NaN     1.0      yes
i    dog  7.0     2.0       no
j    dog  3.0     1.0       no

#### 13. Подсчитайте количество животных каждого типа в `df`.

In [27]:
df.groupby('animal').animal.count()

animal
cat      4
dog      4
snake    2
Name: animal, dtype: int64

#### 14. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [28]:
df.sort_values(by=['age'])

  animal  age  visits priority
c  snake  0.5     2.0       no
f    cat  1.5     3.0       no
a    cat  2.5     1.0      yes
b    cat  3.0     3.0      yes
j    dog  3.0     1.0       no
g  snake  4.5     1.0       no
e    dog  5.0     2.0       no
i    dog  7.0     2.0       no
d    dog  NaN     3.0      yes
h    cat  NaN     1.0      yes

In [29]:
df.sort_values(by=['visits'])

  animal  age  visits priority
a    cat  2.5     1.0      yes
g  snake  4.5     1.0       no
h    cat  NaN     1.0      yes
j    dog  3.0     1.0       no
c  snake  0.5     2.0       no
e    dog  5.0     2.0       no
i    dog  7.0     2.0       no
b    cat  3.0     3.0      yes
d    dog  NaN     3.0      yes
f    cat  1.5     3.0       no

#### 15. В столбце приоритет замените значения на `Yes` и `No`

In [30]:
df.loc[df.priority=='yes', 'priority'] = 'Yes'
df.loc[df.priority=='no', 'priority'] = 'No'
df

  animal  age  visits priority
a    cat  2.5     1.0      Yes
b    cat  3.0     3.0      Yes
c  snake  0.5     2.0       No
d    dog  NaN     3.0      Yes
e    dog  5.0     2.0       No
f    cat  1.5     3.0       No
g  snake  4.5     1.0       No
h    cat  NaN     1.0      Yes
i    dog  7.0     2.0       No
j    dog  3.0     1.0       No

#### 16. В столбце «animal» измените записи «snake» на «python».

In [31]:
df.loc[df.animal=='snake', 'animal'] = 'python'
df

   animal  age  visits priority
a     cat  2.5     1.0      Yes
b     cat  3.0     3.0      Yes
c  python  0.5     2.0       No
d     dog  NaN     3.0      Yes
e     dog  5.0     2.0       No
f     cat  1.5     3.0       No
g  python  4.5     1.0       No
h     cat  NaN     1.0      Yes
i     dog  7.0     2.0       No
j     dog  3.0     1.0       No

#### 17. Удалите все повторения строк из таблицы
```python
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

In [32]:
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df.drop_duplicates(subset=['A'])

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

#### 20. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [38]:
df = pd.DataFrame(np.random.random(size = (5, 10)), columns = list('abcdefghij'))
print(df)
print(df.sum())
j = np.argmin(df.sum())
j

          a         b         c         d         e         f         g  \
0  0.330632  0.885847  0.412803  0.197987  0.445702  0.179839  0.680962
1  0.178748  0.017172  0.239051  0.226583  0.207851  0.962794  0.319101
2  0.812914  0.480480  0.475807  0.553638  0.467016  0.713924  0.547471
3  0.532994  0.051975  0.634378  0.153582  0.138121  0.876104  0.060299
4  0.829085  0.685738  0.099124  0.372429  0.377595  0.144028  0.914905

          h         i         j
0  0.173761  0.203111  0.778183
1  0.606640  0.264899  0.065642
2  0.560055  0.994561  0.504457
3  0.925102  0.556123  0.997333
4  0.907281  0.843959  0.149327
a    2.684374
b    2.121213
c    1.861163
d    1.504218
e    1.636285
f    2.876689
g    2.522739
h    3.172840
i    2.862654
j    2.494943
dtype: float64

'd'

#### 21. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [39]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
print(df)
mean = np.mean(df.value)
df.loc[df['value'].isnull(), 'value'] = mean
print(df)

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0
   group     value
0      a  1.000000
1      a  2.000000
2      b  3.000000
3      b  3.333333
4      a  2.000000
5      b  3.000000
6      b  3.333333
7      b  1.000000
8      a  7.000000
9      b  3.000000
10     a  3.333333
11     b  8.000000

#### 22. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [40]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [45]:
from_to = df.From_To.values
from_to = np.array([a.split('_') for a in from_to])
from2 = from_to[:,0]
to2 = from_to[:,1]
new_from = pd.Series([a.lower().title() for a in from2])
new_to = pd.Series([a.lower().title() for a in to2])
df['From'] = new_from
df['To'] = new_to
del df['From_To']
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London